/******************************************************************************* 
 *  @file      RSGlobal.c 2013\9\9 19:24:17 $
 *  @author    Wang Xiaotao<wangxiaotao1980@gmail.com> (中文编码测试)
 ******************************************************************************/

#include "RSGlobal.h"

int g_RS_N   = 0;                // 要做RS编码的数据长度
int g_RS_K   = 0;                // 做编码的RS编码校验段的长度
int g_RS_ALL = 0;                // 数据段总长度

const unsigned char* g_RS_pGenerator = 0;


// 
// -----------------------------------------------------------------------------
